[Killed] Block removal mutation
lab-2025-i-si784-u2-05-cs-SebastianFuentesAvalos/Bank/Bank.Domain/BankAccount.cs:38:38
     /// <summary>
     /// Obtiene el nombre del cliente propietario de la cuenta.
     /// </summary>
-    public string CustomerName { get { return m_customerName; } }
+    public string CustomerName { get {} }
 
     /// <summary>
killedBy: Bank.Domain.Tests.BankAccountTests.CustomerName_ReturnsCorrectName

[Killed] Block removal mutation
lab-2025-i-si784-u2-05-cs-SebastianFuentesAvalos/Bank/Bank.Domain/BankAccount.cs:43:33
     /// <summary>
     /// Obtiene el saldo actual de la cuenta.
     /// </summary>
-    public double Balance { get { return m_balance; }  }
+    public double Balance { get {}  }
 
     /// <summary>
killedBy: Bank.Domain.Tests.BankAccountTests.Credit_ZeroAmount_ShouldNotChangeBalance; Bank.Domain.Tests.BankAccountTests.Balance_ReturnsInitialBalance; Bank.Domain.Tests.BankAccountTests.MultiDebit_WithValidAmount_UpdatesBalance

[Killed] String mutation
lab-2025-i-si784-u2-05-cs-SebastianFuentesAvalos/Bank/Bank.Domain/BankAccount.cs:55:51
     public void Debit(double amount)
     {
         if (amount > m_balance)
-            throw new ArgumentOutOfRangeException("amount", amount, DebitAmountExceedsBalanceMessage);
+            throw new ArgumentOutOfRangeException("", amount, DebitAmountExceedsBalanceMessage);
         if (amount < 0)
             throw new ArgumentOutOfRangeException("amount", amount, DebitAmountLessThanZeroMessage);
killedBy: Bank.Domain.Tests.BankAccountTests.Debit_WhenAmountIsMoreThanBalance_ShouldThrowArgumentOutOfRange
